[
  {
    "project": "Core 1: Interaction",
    "category": "education",
    "role": "instructor",
    "date": "2024",
    "link": "https://jackrieger.github.io/core-1-interaction/",
    "contribution": 2,
    "description": "Core 1: Interaction is designed to introduce students to programming as a creative medium—as a way of making and exploring. The coursework focuses on developing a vocabulary of interaction design principles which can then be applied across a range of platforms."
  },
  {
    "project": "Core 2: Interaction Lab",
    "category": "education",
    "role": "instructor",
    "date": "2024",
    "link": "https://jackrieger.github.io/core-2-interaction-lab/",
    "contribution": 2,
    "description": "This course serves as a complement to Core Studio Interaction. The assignments are build to work in tandem with the projects students are developing in the studio class. The lab is designed around a series of small workshops that teach beginning and intermediate interaction design through a hands-on engagement with HTML, CSS, and JavaScript."
  },
  {
    "project": "A4 Arts Foundation",
    "category": "engineering",
    "role": "developer",
    "date": "2024",
    "link": "https://www.a4arts.org/",
    "contribution": 3,
    "description": "A4 is an art center in Cape Town, South Africa that describes itself as a “laboratory” – a place to experiment with new ideas and new modes of working. The website is a network connecting communities, artists, images, exhibitions, publications, ephemera and fragments in ways that only A4 can envision. A4 calls the website “a place to find things and a place to get lost; a platform for structured engagements and incidental encounters.”"
  },
  {
    "project": "Core 1: Interaction",
    "category": "education",
    "role": "instructor",
    "date": "2023",
    "contribution": 2,
    "description": "Core 1: Interaction is designed to introduce students to programming as a creative medium—as a way of making and exploring. The coursework focuses on developing a vocabulary of interaction design principles which can then be applied across a range of platforms."
  },
  {
    "project": "Ministry in the City HUB",
    "category": "engineering",
    "role": "lead",
    "date": "2023",
    "link": "https://www.ministryinthecityhub.org/",
    "contribution": 3,
    "description": "The Ministry in the City HUB is a national initiative based at City Seminary of New York built to support the flourishing of ministry in the city in North America. We connect pastors, artists, and leaders of congregations, faith-based organizations and theological institutions concerned with the future of Christian faith in our cities."
  },
  {
    "project": "Parsons CodeLab",
    "category": "education",
    "role": "speaker",
    "date": "2023",
    "contribution": 1,
    "description": "I was invited to give a talk about my career path and work at Parsons CodeLab – a student-led organization that provides community support for designers learning to code, through lectures, workshops, and code jams."
  },
  {
    "project": "Data for Black Lives",
    "category": "engineering",
    "role": "developer",
    "date": "2023",
    "link": "https://d4bl.org/",
    "contribution": 3,
    "description": "This website for Data for Black Lives is an interactive database that surfaces the organization’s work across many channels to abolish data weapons and algorithmic racism."
  },
  {
    "project": "Lockdown University",
    "category": "engineering",
    "role": "developer",
    "date": "2023",
    "link": "https://www.lockdownuniversity.org/",
    "contribution": 3,
    "description": "Lockdown University is an online community and webinar series with lecturers whose expertise spans history, culture, geopolitics, Jewish culture and history, current events, art history, contemporary and classical performing arts, design and architecture, literature, psychology, religion, philosophy, and more."
  },
  {
    "project": "CD Studio: JavaScript",
    "category": "education",
    "role": "speaker",
    "date": "2022",
    "contribution": 1,
    "description": "I was invited to give a workshop at a class taught by Eric Li. This is a computer science class first, and a design class second. Students focus on fundamentals of computing through the lens of JavaScript and its particulars before diving into the creation of a web based application."
  },
  {
    "project": "Core 2: Interaction Lab",
    "category": "education",
    "role": "critic",
    "date": "2022",
    "contribution": 1,
    "description": "I visited Parsons as a guest critic for a class taught by Eric Li. The course is designed around a series of small workshops that teach beginning and intermediate interaction design through a hands-on engagement with HTML, CSS, and JavaScript."
  },
  {
    "project": "Interactive Design and the Internet: Software for People",
    "category": "education",
    "role": "critic",
    "date": "2022",
    "contribution": 1,
    "description": "I visited Yale as a guest critic for a class taught by Rosa McElheny. In this studio course, students create work for the web browser. The class covers foundational, front-end languages HTML, CSS, and JavaScript and introduce principles of interaction design including navigation, pacing, feedback, and adapting to variable screen sizes and devices."
  },
  {
    "project": "Sam Fox School of Design & Visual Arts",
    "category": "engineering",
    "role": "developer",
    "date": "2022",
    "link": "https://samfoxschool.wustl.edu/",
    "contribution": 3,
    "description": "The Sam Fox School of Design & Visual Arts at Washington University in St. Louis is a leader in architecture, art, and design education. Like Sam Fox school, this website’s design and engineering emphasize flexibility, growth, and inclusion. The website seeks to provide a kaleidoscopic view of the many kinds of learning and production that take place here."
  },
  {
    "project": "Tufts University Art Galleries",
    "category": "engineering",
    "role": "maintenance",
    "date": "2022",
    "link": "https://artgalleries.tufts.edu/",
    "contribution": 1,
    "description": "As a maintenance engineer for Tufts University Art Galleries’ website, I have been responsible for implementing improvements, fixing issues, and creating smaller-scale site areas."
  },
  {
    "project": "National Academy of Design Annual Exhibition",
    "category": "engineering",
    "role": "developer",
    "date": "2021",
    "link": "https://www.linkedbyair.net/projects/144-e-pluribus-out-of-many",
    "contribution": 1,
    "description": "In 2020, The National Academy of Design hosted its Annual Exhibition online for the first time, due to the COVID-19 pandemic. Curated by Dr. Kelli Morgan, the annual presents recent work from National Academicians as they respond to the question: What new futures can be created if Americans stop pursuing the ideal of national unity and accept our reality as an incongruent collective? The homepage features unique compositions that recall the salon-style hang used at early annuals."
  },
  {
    "project": "Columbia GSAPP",
    "category": "engineering",
    "role": "maintenance",
    "date": "2021",
    "link": "https://www.arch.columbia.edu/",
    "contribution": 1,
    "description": "As a maintenance engineer for the Columbia Graduate School of Architecture, Planning and Preservation’s website, I have been responsible for implementing improvements, fixing issues, and creating smaller-scale site areas."
  },
  {
    "project": "Economy CMS",
    "category": "engineering",
    "role": "maintenance",
    "date": "2020",
    "ongoing": true,
    "link": "https://ecnmy.com/",
    "contribution": 1,
    "description": "Economy is an easy, powerful, and flexible CMS. As an engineer at Linked by Air, I have contributed fixes, updates, and error troubleshooting in this CMS product."
  },
  {
    "project": "Yale Architecture Advanced Technology",
    "category": "engineering",
    "role": "developer",
    "date": "2020",
    "link": "https://www.architecture.yale.edu/advanced-technology",
    "contribution": 2,
    "description": "Yale Architecture Advanced Technology offers an extensive range of services, support, equipment, and expertise to benefit our students, staff, and faculty."
  },
  {
    "project": "Institute of Contemporary Art, Los Angeles",
    "category": "engineering",
    "role": "maintenance",
    "date": "2020",
    "link": "https://www.theicala.org/en",
    "contribution": 1,
    "description": "As a maintenance engineer for the Institute of Contemporary Art Los Angeles’ website, I have been responsible for implementing improvements, fixing issues, and creating smaller-scale site areas."
  },
  {
    "project": "Museo Jumex",
    "category": "engineering",
    "role": "maintenance",
    "date": "2020",
    "link": "https://www.fundacionjumex.org/en",
    "contribution": 1,
    "description": "As a maintenance engineer for Museo Jumex’s website, I have been responsible for implementing improvements, fixing issues, and creating smaller-scale site areas."
  },
  {
    "project": "The European Fine Art Fair",
    "category": "engineering",
    "role": "developer",
    "date": "2019",
    "link": "https://www.linkedbyair.net/projects/126-tefaf-website",
    "contribution": 1,
    "description": "A website for The European Fine Art Fair, one of the world’s preeminent organizations for fine art, antiques, and design."
  },
  {
    "project": "Deborah Berke Partners",
    "category": "engineering",
    "role": "developer",
    "date": "2019",
    "link": "https://www.linkedbyair.net/projects/90-deborah-berke-partners-website",
    "contribution": 1,
    "description": "Deborah Berke Partners is an architecture practice in New York which recently brought on eight new partners. The site’s design reflects this growth in its ability to showcase all the different aspects of the firm’s practice and principles."
  },
  {
    "project": "The Pedagogy of Design in the Age of Computation",
    "category": "education",
    "role": "speaker",
    "date": "2018",
    "contribution": 1,
    "description": "I was invited to give a talk at a symposium about code and pedagogy in design. Over the last twenty years, design education has had an evolving but uneasy relationship with code. Twenty years later, it’s still an open question how, or whether, the surging number of students studying graphic and communication design should learn to code."
  }
]
